[Killed] ArrowFunction
otus-homework/src/gol/App.tsx:21:5
   const { isLogined } = useLogin();
 
   const onCellClick = useCallback(
-    (coord) => dispatch(appActions.toggleCell(coord)),
+    () => undefined,
     [dispatch]
   );
killedBy: App should call dispatch
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 4
Received number of calls: 3

[Killed] ArrowFunction
otus-homework/src/gol/App.tsx:25:28
     [dispatch]
   );
 
-  const onChangeSettings = (settings: GameSettings) =>
-    dispatch(appActions.setSettings(settings));
+  const onChangeSettings = () => undefined;
   const onReStart = (settings: GameSettings) =>
     dispatch(appActions.reStart(settings));
killedBy: App should buttons work
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="0-59"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <h1
      class="css-1emdcgs"
    >

[Killed] ArrowFunction
otus-homework/src/gol/App.tsx:27:21
 
   const onChangeSettings = (settings: GameSettings) =>
     dispatch(appActions.setSettings(settings));
-  const onReStart = (settings: GameSettings) =>
-    dispatch(appActions.reStart(settings));
+  const onReStart = () => undefined;
   const onStart = () => dispatch(appActions.start());
   const onClear = () => dispatch(appActions.clear());
killedBy: App should call dispatch
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ArrowFunction
otus-homework/src/gol/App.tsx:29:19
     dispatch(appActions.setSettings(settings));
   const onReStart = (settings: GameSettings) =>
     dispatch(appActions.reStart(settings));
-  const onStart = () => dispatch(appActions.start());
+  const onStart = () => undefined;
   const onClear = () => dispatch(appActions.clear());
   const onPause = () => dispatch(appActions.pause());
killedBy: App should buttons work
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="css-1965y3k" data-testid="s-btn-start" mode="primary" type="button">Старт</button> instead

[Killed] ArrowFunction
otus-homework/src/gol/App.tsx:30:19
   const onReStart = (settings: GameSettings) =>
     dispatch(appActions.reStart(settings));
   const onStart = () => dispatch(appActions.start());
-  const onClear = () => dispatch(appActions.clear());
+  const onClear = () => undefined;
   const onPause = () => dispatch(appActions.pause());
   const onLogout = () => dispatch(userActions.logout());
killedBy: App should call dispatch
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] ArrowFunction
otus-homework/src/gol/App.tsx:31:19
     dispatch(appActions.reStart(settings));
   const onStart = () => dispatch(appActions.start());
   const onClear = () => dispatch(appActions.clear());
-  const onPause = () => dispatch(appActions.pause());
+  const onPause = () => undefined;
   const onLogout = () => dispatch(userActions.logout());
 
killedBy: App should buttons work
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="css-1l6agjp" data-testid="s-btn-pause" mode="secondary" type="button">Пауза</button> instead

[Killed] ArrowFunction
otus-homework/src/gol/App.tsx:32:20
   const onStart = () => dispatch(appActions.start());
   const onClear = () => dispatch(appActions.clear());
   const onPause = () => dispatch(appActions.pause());
-  const onLogout = () => dispatch(userActions.logout());
+  const onLogout = () => undefined;
 
   if (!isLogined) return null;
killedBy: App should call dispatch
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 2

[Killed] BooleanLiteral
otus-homework/src/gol/App.tsx:34:7
   const onPause = () => dispatch(appActions.pause());
   const onLogout = () => dispatch(userActions.logout());
 
-  if (!isLogined) return null;
+  if (isLogined) return null;
 
   return (
killedBy: App should buttons work
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ConditionalExpression
otus-homework/src/gol/App.tsx:34:7
   const onPause = () => dispatch(appActions.pause());
   const onLogout = () => dispatch(userActions.logout());
 
-  if (!isLogined) return null;
+  if (true) return null;
 
   return (
killedBy: App should buttons work
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Survived] StringLiteral
otus-homework/src/gol/App.tsx:39:32
   return (
     <>
       <Header>Игра «Жизнь»</Header>
-      <FlexBox justifyContent={'center'} gap={'1rem'}>
+      <FlexBox justifyContent={""} gap={'1rem'}>
         <FlexBox flexDirection={'vertical'}>
           <div>

[Survived] StringLiteral
otus-homework/src/gol/App.tsx:39:47
   return (
     <>
       <Header>Игра «Жизнь»</Header>
-      <FlexBox justifyContent={'center'} gap={'1rem'}>
+      <FlexBox justifyContent={'center'} gap={""}>
         <FlexBox flexDirection={'vertical'}>
           <div>

[Survived] StringLiteral
otus-homework/src/gol/App.tsx:40:33
     <>
       <Header>Игра «Жизнь»</Header>
       <FlexBox justifyContent={'center'} gap={'1rem'}>
-        <FlexBox flexDirection={'vertical'}>
+        <FlexBox flexDirection={""}>
           <div>
             Здравствуйте, <strong>{state.user.name}</strong>
