[Killed] BlockStatement
src/gol/components/FormLogin.tsx:15:68
 
   useLogin();
 
-  const onChangeName = (e: React.ChangeEvent<HTMLInputElement>) => {
-    setUserName(e.target.value);
-  };
+  const onChangeName = (e: React.ChangeEvent<HTMLInputElement>) => {};
 
   const onLogin = () => dispatch(userActions.login(userName.trim()));
killedBy: FormLogin should input Login and submit
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ArrowFunction
src/gol/components/FormLogin.tsx:19:19
     setUserName(e.target.value);
   };
 
-  const onLogin = () => dispatch(userActions.login(userName.trim()));
+  const onLogin = () => undefined;
 
   return (
killedBy: FormLogin should input Login and submit
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/gol/components/FormLogin.tsx:31:55
           onChange={onChangeName}
           value={userName}
         />
-        <Button type="button" onClick={onLogin} mode={'primary'}>
+        <Button type="button" onClick={onLogin} mode={""}>
           Старт
         </Button>
killedBy: FormLogin snapshot FormLogin
statusReason: Error: expect(received).toMatchInlineSnapshot(snapshot)

Snapshot name: `FormLogin snapshot FormLogin 1`

- Snapshot  - 2
+ Received  + 2

@@ -12,12 +12,12 @@
