[Killed] BlockStatement
otus-homework/src/gol/useLogin.ts:7:28
 import { useSelector } from 'react-redux';
 import { selectIsLogined } from './state/selectors';
 
-export function useLogin() {
-  const navigate = useNavigate();
-  const isLogined = useSelector(selectIsLogined);
-
-  useEffect(() => {
-    if (!isLogined) {
-      navigate(ROUTE.LOGIN);
-    } else {
-      navigate(ROUTE.ROOT);
-    }
-  }, [isLogined]);
-
-  return { isLogined };
-}
+export function useLogin() {}
 
killedBy: App should buttons work
statusReason: TypeError: Cannot destructure property 'isLogined' of '(0 , _useLogin.useLogin)(...)' as it is undefined.

[Killed] BlockStatement
otus-homework/src/gol/useLogin.ts:11:19
   const navigate = useNavigate();
   const isLogined = useSelector(selectIsLogined);
 
-  useEffect(() => {
-    if (!isLogined) {
-      navigate(ROUTE.LOGIN);
-    } else {
-      navigate(ROUTE.ROOT);
-    }
-  }, [isLogined]);
+  useEffect(() => {}, [isLogined]);
 
   return { isLogined };
killedBy: useLogin should navigate logined to root
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
otus-homework/src/gol/useLogin.ts:12:9
   const isLogined = useSelector(selectIsLogined);
 
   useEffect(() => {
-    if (!isLogined) {
+    if (false) {
       navigate(ROUTE.LOGIN);
     } else {
killedBy: useLogin should navigate not logined to login page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/login"
Received: "/"

Number of calls: 1

[Killed] BooleanLiteral
otus-homework/src/gol/useLogin.ts:12:9
   const isLogined = useSelector(selectIsLogined);
 
   useEffect(() => {
-    if (!isLogined) {
+    if (isLogined) {
       navigate(ROUTE.LOGIN);
     } else {
killedBy: Index render App component
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] BlockStatement
otus-homework/src/gol/useLogin.ts:14:12
   useEffect(() => {
     if (!isLogined) {
       navigate(ROUTE.LOGIN);
-    } else {
-      navigate(ROUTE.ROOT);
-    }
+    } else {}
   }, [isLogined]);
 
killedBy: useLogin should navigate logined to root
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
