[Killed] ArrowFunction
src/gol/components/Board.tsx:6:32
 import Cell from './Cell';
 import styled from '@emotion/styled';
 
-const BoardStyled = styled.div((props: Coordinates) => ({
-  borderRight: '1px solid grey',
-  borderBottom: '1px solid grey',
-  width: `${props.x * 8}px`,
-  height: `${props.y * 8}px`,
-}));
+const BoardStyled = styled.div(() => undefined);
 
 interface BoardProps {
killedBy: Board snapshot Settings
statusReason: Error: expect(received).toMatchInlineSnapshot(snapshot)

Snapshot name: `Board snapshot Settings 1`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@

[Killed] ObjectLiteral
src/gol/components/Board.tsx:6:57
 import Cell from './Cell';
 import styled from '@emotion/styled';
 
-const BoardStyled = styled.div((props: Coordinates) => ({
-  borderRight: '1px solid grey',
-  borderBottom: '1px solid grey',
-  width: `${props.x * 8}px`,
-  height: `${props.y * 8}px`,
-}));
+const BoardStyled = styled.div((props: Coordinates) => ({}));
 
 interface BoardProps {
killedBy: Board snapshot Settings
statusReason: Error: expect(received).toMatchInlineSnapshot(snapshot)

Snapshot name: `Board snapshot Settings 1`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@

[Killed] StringLiteral
src/gol/components/Board.tsx:7:16
 import styled from '@emotion/styled';
 
 const BoardStyled = styled.div((props: Coordinates) => ({
-  borderRight: '1px solid grey',
+  borderRight: "",
   borderBottom: '1px solid grey',
   width: `${props.x * 8}px`,
killedBy: Board snapshot Settings
statusReason: Error: expect(received).toMatchInlineSnapshot(snapshot)

Snapshot name: `Board snapshot Settings 1`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@

[Killed] ArithmeticOperator
src/gol/components/Board.tsx:9:13
 const BoardStyled = styled.div((props: Coordinates) => ({
   borderRight: '1px solid grey',
   borderBottom: '1px solid grey',
-  width: `${props.x * 8}px`,
+  width: `${props.x / 8}px`,
   height: `${props.y * 8}px`,
 }));
killedBy: Board snapshot Settings
statusReason: Error: expect(received).toMatchInlineSnapshot(snapshot)

Snapshot name: `Board snapshot Settings 1`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@

[Killed] StringLiteral
src/gol/components/Board.tsx:9:10
 const BoardStyled = styled.div((props: Coordinates) => ({
   borderRight: '1px solid grey',
   borderBottom: '1px solid grey',
-  width: `${props.x * 8}px`,
+  width: ``,
   height: `${props.y * 8}px`,
 }));
killedBy: Board snapshot Settings
statusReason: Error: expect(received).toMatchInlineSnapshot(snapshot)

Snapshot name: `Board snapshot Settings 1`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@

[Killed] ArithmeticOperator
src/gol/components/Board.tsx:10:14
   borderRight: '1px solid grey',
   borderBottom: '1px solid grey',
   width: `${props.x * 8}px`,
-  height: `${props.y * 8}px`,
+  height: `${props.y / 8}px`,
 }));
 
killedBy: Board snapshot Settings
statusReason: Error: expect(received).toMatchInlineSnapshot(snapshot)

Snapshot name: `Board snapshot Settings 1`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@

[Killed] BlockStatement
src/gol/components/Board.tsx:18:69
   onCellClick: (coord: Coordinates) => void;
 }
 
-const Board: React.FC<BoardProps> = ({ cellsData, onCellClick }) => {
-  if (!cellsData || cellsData.length === 0) return null;
-
-  return (
-    <BoardStyled x={cellsData[0].length} y={cellsData.length} role="main">
-      {cellsData.map((row, iRow) => (
-        <div key={iRow}>
-          {row.map((cellState, iCell) => {
-            return (
-              <Cell
-                cellState={cellState}
-                key={`${iRow}${iCell}`}
-                x={iCell}
-                y={iRow}
-                onClick={onCellClick}
-              />
-            );
-          })}
-        </div>
-      ))}
-    </BoardStyled>
-  );
-};
+const Board: React.FC<BoardProps> = ({ cellsData, onCellClick }) => {};
 
 export default Board;
killedBy: Board render null
statusReason: Error: Board(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ConditionalExpression
src/gol/components/Board.tsx:19:7
 }
 
 const Board: React.FC<BoardProps> = ({ cellsData, onCellClick }) => {
-  if (!cellsData || cellsData.length === 0) return null;
+  if (false) return null;
 
   return (
killedBy: Board render null
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] ConditionalExpression
src/gol/components/Board.tsx:19:21
 }
 
 const Board: React.FC<BoardProps> = ({ cellsData, onCellClick }) => {
-  if (!cellsData || cellsData.length === 0) return null;
+  if (!cellsData || false) return null;
 
   return (
killedBy: Board render null
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] ArrowFunction
src/gol/components/Board.tsx:23:22
 
   return (
     <BoardStyled x={cellsData[0].length} y={cellsData.length} role="main">
-      {cellsData.map((row, iRow) => (
-        <div key={iRow}>
-          {row.map((cellState, iCell) => {
-            return (
-              <Cell
-                cellState={cellState}
-                key={`${iRow}${iCell}`}
-                x={iCell}
-                y={iRow}
-                onClick={onCellClick}
-              />
-            );
-          })}
-        </div>
-      ))}
+      {cellsData.map(() => undefined)}
     </BoardStyled>
   );
killedBy: App should buttons work
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="0-59"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <h1
      class="css-1emdcgs"
    >

[Killed] BlockStatement
src/gol/components/Board.tsx:25:42
     <BoardStyled x={cellsData[0].length} y={cellsData.length} role="main">
       {cellsData.map((row, iRow) => (
         <div key={iRow}>
-          {row.map((cellState, iCell) => {
-            return (
-              <Cell
-                cellState={cellState}
-                key={`${iRow}${iCell}`}
-                x={iCell}
-                y={iRow}
-                onClick={onCellClick}
-              />
-            );
-          })}
+          {row.map((cellState, iCell) => {})}
         </div>
       ))}
killedBy: Board render 3x4
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="0-0"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="css-17sa7h6"
      role="main"
