[Killed] ArrowFunction
src/gol/components/Cell.tsx:10:23
 }
 
 const CellStyled = styled.span`
-  background-color: ${(props: CellStyledProps) =>
-    props.cellState === 1 ? 'darkgray' : 'white'};
+  background-color: ${() => undefined};
   width: 8px;
   height: 8px;
killedBy: Board snapshot Settings
statusReason: Error: expect(received).toMatchInlineSnapshot(snapshot)

Snapshot name: `Board snapshot Settings 1`

- Snapshot  - 4
+ Received  + 4

@@ -5,25 +5,25 @@

[Killed] ConditionalExpression
src/gol/components/Cell.tsx:11:5
 
 const CellStyled = styled.span`
   background-color: ${(props: CellStyledProps) =>
-    props.cellState === 1 ? 'darkgray' : 'white'};
+    false ? 'darkgray' : 'white'};
   width: 8px;
   height: 8px;
killedBy: Board snapshot Settings
statusReason: Error: expect(received).toMatchInlineSnapshot(snapshot)

Snapshot name: `Board snapshot Settings 1`

- Snapshot  - 2
+ Received  + 2

@@ -9,17 +9,17 @@

[Killed] EqualityOperator
src/gol/components/Cell.tsx:11:5
 
 const CellStyled = styled.span`
   background-color: ${(props: CellStyledProps) =>
-    props.cellState === 1 ? 'darkgray' : 'white'};
+    props.cellState !== 1 ? 'darkgray' : 'white'};
   width: 8px;
   height: 8px;
killedBy: Cell snapshot empty (dead)
statusReason: Error: expect(received).toMatchInlineSnapshot(snapshot)

Snapshot name: `Cell snapshot empty (dead) 1`

- Snapshot  - 1
+ Received  + 1

  <div>

[Timeout] BlockStatement
src/gol/components/Cell.tsx:27:57
   y: number;
 }
 
-const Cell: React.FC<CellProps> = React.memo((props) => {
-  const { cellState, x, y, onClick } = props;
-
-  const handleOnClick = () => onClick({ x, y });
-
-  return (
-    <CellStyled
-      cellState={cellState}
-      data-testid={`${y}-${x}`}
-      onClick={handleOnClick}
-    />
-  );
-});
+const Cell: React.FC<CellProps> = React.memo((props) => {});
 
 Cell.displayName = 'Cell';

[Killed] ArrowFunction
src/gol/components/Cell.tsx:30:25
 const Cell: React.FC<CellProps> = React.memo((props) => {
   const { cellState, x, y, onClick } = props;
 
-  const handleOnClick = () => onClick({ x, y });
+  const handleOnClick = () => undefined;
 
   return (
killedBy: Cell click Cell
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
