[Killed] BooleanLiteral
src/gol/components/Settings.tsx:33:42
   const [boardSizeY, setBoardSizeY] = useState<number>(boardSize.y);
   const [gameSpeed, setGameSpeed] = useState(speed);
   const [boardFill, setBoardFill] = useState<number>(boardFillPercent);
-  const [changed, setChanged] = useState(false);
+  const [changed, setChanged] = useState(true);
   const [changedNew, setChangedNew] = useState(false);
 
killedBy: Settings disabled buttons ok
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 0
Received number of calls: 1

[Killed] BooleanLiteral
src/gol/components/Settings.tsx:34:48
   const [gameSpeed, setGameSpeed] = useState(speed);
   const [boardFill, setBoardFill] = useState<number>(boardFillPercent);
   const [changed, setChanged] = useState(false);
-  const [changedNew, setChangedNew] = useState(false);
+  const [changedNew, setChangedNew] = useState(true);
 
   const getNewSettings = () => {
killedBy: Settings snapshot Settings
statusReason: Error: expect(received).toMatchInlineSnapshot(snapshot)

Snapshot name: `Settings snapshot Settings 1`

- Snapshot  - 1
+ Received  + 2

@@ -104,12 +104,13 @@

[Killed] BlockStatement
src/gol/components/Settings.tsx:36:32
   const [changed, setChanged] = useState(false);
   const [changedNew, setChangedNew] = useState(false);
 
-  const getNewSettings = () => {
-    return {
-      boardFillPercent: boardFill,
-      speed: gameSpeed,
-      boardSize: {
-        x: boardSizeX,
-        y: boardSizeY,
-      },
-    };
-  };
+  const getNewSettings = () => {};
 
   const save = () => {
killedBy: App should buttons work
statusReason: TypeError: Cannot read property 'boardSize' of undefined

[Killed] ObjectLiteral
src/gol/components/Settings.tsx:37:12
   const [changedNew, setChangedNew] = useState(false);
 
   const getNewSettings = () => {
-    return {
-      boardFillPercent: boardFill,
-      speed: gameSpeed,
-      boardSize: {
-        x: boardSizeX,
-        y: boardSizeY,
-      },
-    };
+    return {};
   };
 
killedBy: App should buttons work
statusReason: TypeError: Cannot read property 'x' of undefined

[Killed] ObjectLiteral
src/gol/components/Settings.tsx:40:18
     return {
       boardFillPercent: boardFill,
       speed: gameSpeed,
-      boardSize: {
-        x: boardSizeX,
-        y: boardSizeY,
-      },
+      boardSize: {},
     };
   };
killedBy: Settings input settings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "boardFillPercent": 25,
-   "boardSize": Object {

[Killed] BlockStatement
src/gol/components/Settings.tsx:47:22
     };
   };
 
-  const save = () => {
-    onChangeSettings(getNewSettings());
-    setChanged(false);
-  };
+  const save = () => {};
 
   const cancel = () => {
killedBy: App should buttons work
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="0-59"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <h1
      class="css-1emdcgs"
    >

[Survived] BooleanLiteral
src/gol/components/Settings.tsx:49:16
 
   const save = () => {
     onChangeSettings(getNewSettings());
-    setChanged(false);
+    setChanged(true);
   };
 

[Timeout] BlockStatement
src/gol/components/Settings.tsx:52:24
     setChanged(false);
   };
 
-  const cancel = () => {
-    setBoardSizeX(boardSize.x);
-    setBoardSizeY(boardSize.y);
-    setGameSpeed(speed);
-    setChanged(false);
-  };
+  const cancel = () => {};
 
   const reRun = () => {

[Survived] BooleanLiteral
src/gol/components/Settings.tsx:56:16
     setBoardSizeX(boardSize.x);
     setBoardSizeY(boardSize.y);
     setGameSpeed(speed);
-    setChanged(false);
+    setChanged(true);
   };
 

[Killed] BlockStatement
src/gol/components/Settings.tsx:59:23
     setChanged(false);
   };
 
-  const reRun = () => {
-    onReStart(getNewSettings());
-    setChangedNew(false);
-  };
+  const reRun = () => {};
 
   const onChangeBoardSizeX = (e: React.ChangeEvent<HTMLInputElement>) => {
killedBy: App should call dispatch
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] BooleanLiteral
src/gol/components/Settings.tsx:61:19
 
   const reRun = () => {
     onReStart(getNewSettings());
-    setChangedNew(false);
+    setChangedNew(true);
   };
 

[Killed] BlockStatement
src/gol/components/Settings.tsx:64:74
     setChangedNew(false);
   };
 
-  const onChangeBoardSizeX = (e: React.ChangeEvent<HTMLInputElement>) => {
-    setBoardSizeX(parseInt(e.target.value, 10));
-    setChanged(true);
-  };
+  const onChangeBoardSizeX = (e: React.ChangeEvent<HTMLInputElement>) => {};
 
   const onChangeBoardSizeY = (e: React.ChangeEvent<HTMLInputElement>) => {
killedBy: App should buttons work
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="0-59"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <h1
      class="css-1emdcgs"
    >

[Killed] BooleanLiteral
src/gol/components/Settings.tsx:66:16
 
   const onChangeBoardSizeX = (e: React.ChangeEvent<HTMLInputElement>) => {
     setBoardSizeX(parseInt(e.target.value, 10));
-    setChanged(true);
+    setChanged(false);
   };
 
killedBy: App should buttons work
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="0-59"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <h1
      class="css-1emdcgs"
    >

[Killed] BlockStatement
src/gol/components/Settings.tsx:69:74
     setChanged(true);
   };
 
-  const onChangeBoardSizeY = (e: React.ChangeEvent<HTMLInputElement>) => {
-    setBoardSizeY(parseInt(e.target.value, 10));
-    setChanged(true);
-  };
+  const onChangeBoardSizeY = (e: React.ChangeEvent<HTMLInputElement>) => {};
 
   const onChangeSpeed = (e: React.ChangeEvent<HTMLInputElement>) => {
killedBy: Settings input settings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "boardFillPercent": 25,
    "boardSize": Object {

[Survived] BooleanLiteral
src/gol/components/Settings.tsx:71:16
 
   const onChangeBoardSizeY = (e: React.ChangeEvent<HTMLInputElement>) => {
     setBoardSizeY(parseInt(e.target.value, 10));
-    setChanged(true);
+    setChanged(false);
   };
 

[Killed] BlockStatement
src/gol/components/Settings.tsx:74:69
     setChanged(true);
   };
 
-  const onChangeSpeed = (e: React.ChangeEvent<HTMLInputElement>) => {
-    setGameSpeed(parseInt(e.target.value, 10));
-    setChanged(true);
-  };
+  const onChangeSpeed = (e: React.ChangeEvent<HTMLInputElement>) => {};
 
   const onChangeBoardFillPercent = (e: React.ChangeEvent<HTMLInputElement>) => {
killedBy: Settings input settings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,7 +2,7 @@
    "boardFillPercent": 25,
    "boardSize": Object {

[Killed] BooleanLiteral
src/gol/components/Settings.tsx:76:16
 
   const onChangeSpeed = (e: React.ChangeEvent<HTMLInputElement>) => {
     setGameSpeed(parseInt(e.target.value, 10));
-    setChanged(true);
+    setChanged(false);
   };
 
killedBy: Settings input settings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/gol/components/Settings.tsx:79:80
     setChanged(true);
   };
 
-  const onChangeBoardFillPercent = (e: React.ChangeEvent<HTMLInputElement>) => {
-    setBoardFill(parseInt(e.target.value, 10));
-    setChangedNew(true);
-  };
+  const onChangeBoardFillPercent = (e: React.ChangeEvent<HTMLInputElement>) => {};
 
   return (
killedBy: Settings input settings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,7 +1,7 @@
  Object {
-   "boardFillPercent": 25,

[Survived] BooleanLiteral
src/gol/components/Settings.tsx:81:19
 
   const onChangeBoardFillPercent = (e: React.ChangeEvent<HTMLInputElement>) => {
     setBoardFill(parseInt(e.target.value, 10));
-    setChangedNew(true);
+    setChangedNew(false);
   };
 

[Killed] StringLiteral
src/gol/components/Settings.tsx:115:61
           onChange={onChangeSpeed}
         />
       </div>
-      <FlexBox flexDirection={'horisontal'} justifyContent={'center'}>
+      <FlexBox flexDirection={'horisontal'} justifyContent={""}>
         <Button
           type="button"
killedBy: Settings snapshot Settings
statusReason: Error: expect(received).toMatchInlineSnapshot(snapshot)

Snapshot name: `Settings snapshot Settings 1`

- Snapshot  - 1
+ Received  + 1

@@ -64,11 +64,11 @@

[Survived] StringLiteral
src/gol/components/Settings.tsx:115:31
           onChange={onChangeSpeed}
         />
       </div>
-      <FlexBox flexDirection={'horisontal'} justifyContent={'center'}>
+      <FlexBox flexDirection={""} justifyContent={'center'}>
         <Button
           type="button"

[Survived] StringLiteral
src/gol/components/Settings.tsx:120:27
           type="button"
           onClick={save}
           data-testid="s-btn-ok"
-          mode={changed ? 'primary' : undefined}
+          mode={changed ? "" : undefined}
           disabled={!changed}
         >

[Killed] BooleanLiteral
src/gol/components/Settings.tsx:121:21
           onClick={save}
           data-testid="s-btn-ok"
           mode={changed ? 'primary' : undefined}
-          disabled={!changed}
+          disabled={changed}
         >
           Применить
killedBy: Settings input settings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BooleanLiteral
src/gol/components/Settings.tsx:129:21
           type="button"
           onClick={cancel}
           data-testid="s-btn-cancel"
-          disabled={!changed}
+          disabled={changed}
         >
           Отменить
killedBy: Settings button cancel should reset changes
statusReason: Error: expect(element).toHaveDisplayValue()

Expected element to have display value:
  10
Received:
  ["30"]

[Killed] ConditionalExpression
src/gol/components/Settings.tsx:156:8
       <Button type="button" onClick={onClear} data-testid="s-btn-clear">
         Очистить
       </Button>
-      {status === 'play' ? (
+      {true ? (
         <Button
           type="button"
killedBy: App should buttons work
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="s-btn-start"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <h1
      class="css-1emdcgs"
    >

[Killed] EqualityOperator
src/gol/components/Settings.tsx:156:8
       <Button type="button" onClick={onClear} data-testid="s-btn-clear">
         Очистить
       </Button>
-      {status === 'play' ? (
+      {status !== 'play' ? (
         <Button
           type="button"
killedBy: App should buttons work
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="s-btn-start"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <h1
      class="css-1emdcgs"
    >

[Killed] EqualityOperator
src/gol/components/Settings.tsx:172:12
           data-testid="s-btn-start"
           mode="primary"
         >
-          {status === 'pause' ? 'Возобновить' : 'Старт'}
+          {status !== 'pause' ? 'Возобновить' : 'Старт'}
         </Button>
       )}
killedBy: Settings snapshot Settings
statusReason: Error: expect(received).toMatchInlineSnapshot(snapshot)

Snapshot name: `Settings snapshot Settings 1`

- Snapshot  - 1
+ Received  + 1

@@ -123,9 +123,9 @@

[Killed] ConditionalExpression
src/gol/components/Settings.tsx:172:12
           data-testid="s-btn-start"
           mode="primary"
         >
-          {status === 'pause' ? 'Возобновить' : 'Старт'}
+          {false ? 'Возобновить' : 'Старт'}
         </Button>
       )}
killedBy: Settings snapshot Settings
statusReason: Error: expect(received).toMatchInlineSnapshot(snapshot)

Snapshot name: `Settings snapshot Settings 1`

- Snapshot  - 1
+ Received  + 1

@@ -123,9 +123,9 @@
