[Timeout] StringLiteral
otus-homework/src/gol/localStorage.ts:1:40
-export const LOCAL_STORAGE_LOGIN_KEY = 'login';
+export const LOCAL_STORAGE_LOGIN_KEY = "";
 
 export const saveLogin = (login: string) => {

[Timeout] BlockStatement
otus-homework/src/gol/localStorage.ts:3:45
 export const LOCAL_STORAGE_LOGIN_KEY = 'login';
 
-export const saveLogin = (login: string) => {
-  localStorage.setItem(LOCAL_STORAGE_LOGIN_KEY, login);
-};
+export const saveLogin = (login: string) => {};
 
 export const loadLogin = () => {

[Killed] BlockStatement
otus-homework/src/gol/localStorage.ts:7:32
   localStorage.setItem(LOCAL_STORAGE_LOGIN_KEY, login);
 };
 
-export const loadLogin = () => {
-  return localStorage.getItem(LOCAL_STORAGE_LOGIN_KEY);
-};
+export const loadLogin = () => {};
 
killedBy: FormLogin should input Login and submit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Имя"
Received: undefined
