[Survived] StringLiteral
src/gol/state/appSlice.ts:26:11
 
 export const initialState: State = {
   settings: initialSettings,
-  status: 'stop',
+  status: "",
   cellsData: generateBoard(initialSettings),
 };

[Survived] BlockStatement
src/gol/state/appSlice.ts:30:29
   cellsData: generateBoard(initialSettings),
 };
 
-export function* playGame() {
-  while (true) {
-    const app: State = yield select(selectApp);
-    if (app.status !== 'play') break;
-    yield put(appActions.setCellsData(nextGeneration(app.cellsData)));
-    yield delay(speedToMs(app.settings.speed));
-  }
-}
+export function* playGame() {}
 
 export const appSlice = createSlice({

[Timeout] BlockStatement
src/gol/state/appSlice.ts:31:16
 };
 
 export function* playGame() {
-  while (true) {
-    const app: State = yield select(selectApp);
-    if (app.status !== 'play') break;
-    yield put(appActions.setCellsData(nextGeneration(app.cellsData)));
-    yield delay(speedToMs(app.settings.speed));
-  }
+  while (true) {}
 }
 

[Survived] BooleanLiteral
src/gol/state/appSlice.ts:31:10
 };
 
 export function* playGame() {
-  while (true) {
+  while (false) {
     const app: State = yield select(selectApp);
     if (app.status !== 'play') break;

[Survived] ConditionalExpression
src/gol/state/appSlice.ts:33:9
 export function* playGame() {
   while (true) {
     const app: State = yield select(selectApp);
-    if (app.status !== 'play') break;
+    if (true) break;
     yield put(appActions.setCellsData(nextGeneration(app.cellsData)));
     yield delay(speedToMs(app.settings.speed));

[Survived] ConditionalExpression
src/gol/state/appSlice.ts:33:9
 export function* playGame() {
   while (true) {
     const app: State = yield select(selectApp);
-    if (app.status !== 'play') break;
+    if (false) break;
     yield put(appActions.setCellsData(nextGeneration(app.cellsData)));
     yield delay(speedToMs(app.settings.speed));

[Killed] BlockStatement
src/gol/state/appSlice.ts:43:66
   name: 'app',
   initialState,
   reducers: {
-    setSettings: (state, action: PayloadAction<GameSettings>) => {
-      if (
-        action.payload.boardSize.x !== state.settings.boardSize.x ||
-        action.payload.boardSize.y !== state.settings.boardSize.y
-      ) {
-        state.cellsData = resizeBoard(
-          state.cellsData,
-          action.payload.boardSize
-        );
-      }
-      state.settings = action.payload;
-    },
+    setSettings: (state, action: PayloadAction<GameSettings>) => {},
     setCellsData: (state, action: PayloadAction<CellsData>) => {
       state.cellsData = action.payload;
killedBy: App should buttons work
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="0-59"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <h1
      class="css-1emdcgs"
    >

[Killed] EqualityOperator
src/gol/state/appSlice.ts:45:9
   reducers: {
     setSettings: (state, action: PayloadAction<GameSettings>) => {
       if (
-        action.payload.boardSize.x !== state.settings.boardSize.x ||
+        action.payload.boardSize.x === state.settings.boardSize.x ||
         action.payload.boardSize.y !== state.settings.boardSize.y
       ) {
killedBy: App should buttons work
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="0-59"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <h1
      class="css-1emdcgs"
    >

[Killed] LogicalOperator
src/gol/state/appSlice.ts:45:9
   reducers: {
     setSettings: (state, action: PayloadAction<GameSettings>) => {
       if (
-        action.payload.boardSize.x !== state.settings.boardSize.x ||
-        action.payload.boardSize.y !== state.settings.boardSize.y
+        action.payload.boardSize.x !== state.settings.boardSize.x && action.payload.boardSize.y !== state.settings.boardSize.y
       ) {
         state.cellsData = resizeBoard(
killedBy: App should buttons work
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="0-59"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <h1
      class="css-1emdcgs"
    >

[Survived] ConditionalExpression
src/gol/state/appSlice.ts:46:9
     setSettings: (state, action: PayloadAction<GameSettings>) => {
       if (
         action.payload.boardSize.x !== state.settings.boardSize.x ||
-        action.payload.boardSize.y !== state.settings.boardSize.y
+        false
       ) {
         state.cellsData = resizeBoard(

[Survived] EqualityOperator
src/gol/state/appSlice.ts:46:9
     setSettings: (state, action: PayloadAction<GameSettings>) => {
       if (
         action.payload.boardSize.x !== state.settings.boardSize.x ||
-        action.payload.boardSize.y !== state.settings.boardSize.y
+        action.payload.boardSize.y === state.settings.boardSize.y
       ) {
         state.cellsData = resizeBoard(

[Killed] BlockStatement
src/gol/state/appSlice.ts:47:9
       if (
         action.payload.boardSize.x !== state.settings.boardSize.x ||
         action.payload.boardSize.y !== state.settings.boardSize.y
-      ) {
-        state.cellsData = resizeBoard(
-          state.cellsData,
-          action.payload.boardSize
-        );
-      }
+      ) {}
       state.settings = action.payload;
     },
killedBy: App should buttons work
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="0-59"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <h1
      class="css-1emdcgs"
    >

[Killed] BlockStatement
src/gol/state/appSlice.ts:55:64
       }
       state.settings = action.payload;
     },
-    setCellsData: (state, action: PayloadAction<CellsData>) => {
-      state.cellsData = action.payload;
-    },
+    setCellsData: (state, action: PayloadAction<CellsData>) => {},
     toggleCell: (state, action: PayloadAction<Coordinates>) => {
       const coord = action.payload;
killedBy: appSlice reducer should setCellsData set cellsData
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

@@ -1,13 +1,15 @@
  Object {
    "cellsData": Array [

[Killed] BlockStatement
src/gol/state/appSlice.ts:58:64
     setCellsData: (state, action: PayloadAction<CellsData>) => {
       state.cellsData = action.payload;
     },
-    toggleCell: (state, action: PayloadAction<Coordinates>) => {
-      const coord = action.payload;
-      if (coord.y >= state.cellsData.length || coord.y < 0) return;
-      if (coord.x < 0 || coord.x >= state.cellsData[coord.y].length) return;
-      const cellsData = state.cellsData;
-      cellsData[coord.y][coord.x] =
-        cellsData[coord.y][coord.x] === cellStateAlive
-          ? cellStateEmpty
-          : cellStateAlive;
-    },
+    toggleCell: (state, action: PayloadAction<Coordinates>) => {},
     reStart: (state, action: PayloadAction<GameSettings>) => {
       state.cellsData = generateBoard(action.payload);
killedBy: appSlice reducer should toggleCell toggle cell state in board
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] EqualityOperator
src/gol/state/appSlice.ts:60:11
     },
     toggleCell: (state, action: PayloadAction<Coordinates>) => {
       const coord = action.payload;
-      if (coord.y >= state.cellsData.length || coord.y < 0) return;
+      if (coord.y > state.cellsData.length || coord.y < 0) return;
       if (coord.x < 0 || coord.x >= state.cellsData[coord.y].length) return;
       const cellsData = state.cellsData;
killedBy: appSlice reducer toggleCell out of board
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] ConditionalExpression
src/gol/state/appSlice.ts:60:11
     },
     toggleCell: (state, action: PayloadAction<Coordinates>) => {
       const coord = action.payload;
-      if (coord.y >= state.cellsData.length || coord.y < 0) return;
+      if (false || coord.y < 0) return;
       if (coord.x < 0 || coord.x >= state.cellsData[coord.y].length) return;
       const cellsData = state.cellsData;
killedBy: appSlice reducer toggleCell out of board
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] EqualityOperator
src/gol/state/appSlice.ts:61:26
     toggleCell: (state, action: PayloadAction<Coordinates>) => {
       const coord = action.payload;
       if (coord.y >= state.cellsData.length || coord.y < 0) return;
-      if (coord.x < 0 || coord.x >= state.cellsData[coord.y].length) return;
+      if (coord.x < 0 || coord.x < state.cellsData[coord.y].length) return;
       const cellsData = state.cellsData;
       cellsData[coord.y][coord.x] =
killedBy: appSlice reducer should toggleCell toggle cell state in board
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/gol/state/appSlice.ts:61:11
     toggleCell: (state, action: PayloadAction<Coordinates>) => {
       const coord = action.payload;
       if (coord.y >= state.cellsData.length || coord.y < 0) return;
-      if (coord.x < 0 || coord.x >= state.cellsData[coord.y].length) return;
+      if (false) return;
       const cellsData = state.cellsData;
       cellsData[coord.y][coord.x] =
killedBy: appSlice reducer toggleCell out of board
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: [[0, 1, 0], [1, 0, 0]]
Received: serializes to the same string

[Killed] ConditionalExpression
src/gol/state/appSlice.ts:64:9
       if (coord.x < 0 || coord.x >= state.cellsData[coord.y].length) return;
       const cellsData = state.cellsData;
       cellsData[coord.y][coord.x] =
-        cellsData[coord.y][coord.x] === cellStateAlive
+        false
           ? cellStateEmpty
           : cellStateAlive;
killedBy: appSlice reducer should toggleCell toggle cell state in board
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Timeout] EqualityOperator
src/gol/state/appSlice.ts:64:9
       if (coord.x < 0 || coord.x >= state.cellsData[coord.y].length) return;
       const cellsData = state.cellsData;
       cellsData[coord.y][coord.x] =
-        cellsData[coord.y][coord.x] === cellStateAlive
+        cellsData[coord.y][coord.x] !== cellStateAlive
           ? cellStateEmpty
           : cellStateAlive;

[Killed] BlockStatement
src/gol/state/appSlice.ts:68:62
           ? cellStateEmpty
           : cellStateAlive;
     },
-    reStart: (state, action: PayloadAction<GameSettings>) => {
-      state.cellsData = generateBoard(action.payload);
-      state.status = 'stop';
-      state.settings = action.payload;
-    },
+    reStart: (state, action: PayloadAction<GameSettings>) => {},
     start: (state) => {
       state.status = 'play';
killedBy: appSlice reducer reStart
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
    "boardFillPercent": 10,
    "boardSize": Object {

[Killed] StringLiteral
src/gol/state/appSlice.ts:70:22
     },
     reStart: (state, action: PayloadAction<GameSettings>) => {
       state.cellsData = generateBoard(action.payload);
-      state.status = 'stop';
+      state.status = "";
       state.settings = action.payload;
     },
killedBy: appSlice reducer reStart
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stop"
Received: ""

[Killed] BlockStatement
src/gol/state/appSlice.ts:73:23
       state.status = 'stop';
       state.settings = action.payload;
     },
-    start: (state) => {
-      state.status = 'play';
-    },
+    start: (state) => {},
     pause: (state) => {
       state.status = 'pause';
killedBy: appSlice reducer start
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "play"
Received: "stop"

[Killed] BlockStatement
src/gol/state/appSlice.ts:76:23
     start: (state) => {
       state.status = 'play';
     },
-    pause: (state) => {
-      state.status = 'pause';
-    },
+    pause: (state) => {},
     clear: (state) => {
       state.cellsData = generateBoardXY(
killedBy: appSlice reducer pause
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pause"
Received: "stop"

[Killed] BlockStatement
src/gol/state/appSlice.ts:79:23
     pause: (state) => {
       state.status = 'pause';
     },
-    clear: (state) => {
-      state.cellsData = generateBoardXY(
-        state.settings.boardSize,
-        cellStateEmpty
-      );
-    },
+    clear: (state) => {},
   },
   extraReducers: (builder) => {
killedBy: appSlice reducer clear
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: undefined
Received: [0, 1, 0]

[Killed] BlockStatement
src/gol/state/appSlice.ts:86:31
       );
     },
   },
-  extraReducers: (builder) => {
-    builder.addCase(userActions.logout.type, (state) => {
-      state.status = 'stop';
-      state.settings = initialSettings;
-      state.cellsData = generateBoard(initialSettings);
-    });
-  },
+  extraReducers: (builder) => {},
 });
 
killedBy: appSlice reducer logout should reset state to init
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
-   "boardFillPercent": 15,
+   "boardFillPercent": 10,

[Killed] BlockStatement
src/gol/state/appSlice.ts:87:57
     },
   },
   extraReducers: (builder) => {
-    builder.addCase(userActions.logout.type, (state) => {
-      state.status = 'stop';
-      state.settings = initialSettings;
-      state.cellsData = generateBoard(initialSettings);
-    });
+    builder.addCase(userActions.logout.type, (state) => {});
   },
 });
killedBy: appSlice reducer logout should reset state to init
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
-   "boardFillPercent": 15,
+   "boardFillPercent": 10,
