[Killed] BlockStatement
src/gol/state/saga.ts:5:37
 import { appActions, playGame } from './appSlice';
 import { userActions, onLogin, onLogout } from './userSlice';
 
-export default function* rootSaga() {
-  yield takeEvery(userActions.login.type, onLogin);
-  yield takeEvery(userActions.logout.type, onLogout);
-  yield takeEvery(appActions.start.type, playGame);
-}
+export default function* rootSaga() {}
 
killedBy: FormLogin should input Login and submit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Имя"
Received: null
