[Killed] ArrowFunction
src/gol/state/selectors.ts:3:28
 import { RootState } from './store';
 
-export const selectState = (state: RootState): RootState => state;
+export const selectState = () => undefined;
 export const selectIsLogined = (state: RootState): boolean =>
   state.user && state.user.name !== '';
killedBy: App should buttons work
statusReason: TypeError: Cannot read property 'user' of undefined

[Killed] ArrowFunction
src/gol/state/selectors.ts:4:32
 import { RootState } from './store';
 
 export const selectState = (state: RootState): RootState => state;
-export const selectIsLogined = (state: RootState): boolean =>
-  state.user && state.user.name !== '';
+export const selectIsLogined = () => undefined;
 export const selectApp = (state: RootState) => state.app;
 
killedBy: App should buttons work
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] EqualityOperator
src/gol/state/selectors.ts:5:17
 
 export const selectState = (state: RootState): RootState => state;
 export const selectIsLogined = (state: RootState): boolean =>
-  state.user && state.user.name !== '';
+  state.user && state.user.name === '';
 export const selectApp = (state: RootState) => state.app;
 
killedBy: Index render App component
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ConditionalExpression
src/gol/state/selectors.ts:5:17
 
 export const selectState = (state: RootState): RootState => state;
 export const selectIsLogined = (state: RootState): boolean =>
-  state.user && state.user.name !== '';
+  state.user && true;
 export const selectApp = (state: RootState) => state.app;
 
killedBy: selectors should select state
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Timeout] ArrowFunction
src/gol/state/selectors.ts:6:26
 export const selectState = (state: RootState): RootState => state;
 export const selectIsLogined = (state: RootState): boolean =>
   state.user && state.user.name !== '';
-export const selectApp = (state: RootState) => state.app;
+export const selectApp = () => undefined;
 
