[Survived] BooleanLiteral
src/gol/state/store.ts:16:35
     user: userReducer,
   },
   middleware: (getDefaultMiddleware) =>
-    getDefaultMiddleware({ thunk: false }).concat(sagaMiddleware),
+    getDefaultMiddleware({ thunk: true }).concat(sagaMiddleware),
 });
 

[Survived] ObjectLiteral
src/gol/state/store.ts:16:26
     user: userReducer,
   },
   middleware: (getDefaultMiddleware) =>
-    getDefaultMiddleware({ thunk: false }).concat(sagaMiddleware),
+    getDefaultMiddleware({}).concat(sagaMiddleware),
 });
 

[Survived] ArrowFunction
src/gol/state/store.ts:26:31
 export type RootState = ReturnType<typeof store.getState>;
 export type AppDispatch = typeof store.dispatch;
 
-export const useAppDispatch = () => useDispatch<AppDispatch>();
+export const useAppDispatch = () => undefined;
 export const useAppSelector: TypedUseSelectorHook<RootState> = useSelector;
 
