[Killed] ObjectLiteral
src/gol/state/userSlice.ts:6:17
 import { put } from 'redux-saga/effects';
 
 export const userSlice = createSlice({
-  initialState: {
-    name: loadLogin() || '',
-  },
+  initialState: {},
   name: 'user',
   reducers: {
killedBy: App should buttons work
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ConditionalExpression
src/gol/state/userSlice.ts:7:11
 
 export const userSlice = createSlice({
   initialState: {
-    name: loadLogin() || '',
+    name: false,
   },
   name: 'user',
killedBy: selectors should select state
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -2611,8 +2611,8 @@
        "speed": 2,
      },

[Killed] LogicalOperator
src/gol/state/userSlice.ts:7:11
 
 export const userSlice = createSlice({
   initialState: {
-    name: loadLogin() || '',
+    name: loadLogin() && '',
   },
   name: 'user',
killedBy: App should buttons work
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] BlockStatement
src/gol/state/userSlice.ts:11:56
   },
   name: 'user',
   reducers: {
-    setUser: (state, action: PayloadAction<string>) => {
-      state.name = action.payload;
-    },
+    setUser: (state, action: PayloadAction<string>) => {},
     // eslint-disable-next-line @typescript-eslint/no-unused-vars
     login: (_state, _action: PayloadAction<string>) => void 0,
killedBy: userSlice reducer setUser
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "name": "my name",
+   "name": "",

[Survived] ArrowFunction
src/gol/state/userSlice.ts:15:12
       state.name = action.payload;
     },
     // eslint-disable-next-line @typescript-eslint/no-unused-vars
-    login: (_state, _action: PayloadAction<string>) => void 0,
+    login: () => undefined,
     logout: () => void 0,
   },

[Survived] ArrowFunction
src/gol/state/userSlice.ts:16:13
     },
     // eslint-disable-next-line @typescript-eslint/no-unused-vars
     login: (_state, _action: PayloadAction<string>) => void 0,
-    logout: () => void 0,
+    logout: () => undefined,
   },
 });

[Killed] BlockStatement
src/gol/state/userSlice.ts:30:50
 };
 export type AppActionLogout = { type: typeof userActions.logout.type };
 
-export function* onLogin(action: AppActionLogin) {
-  const name = action.payload;
-  saveLogin(name);
-  yield put(userActions.setUser(name));
-}
+export function* onLogin(action: AppActionLogin) {}
 
 export function* onLogout() {
killedBy: userSlice reducer onLogin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "my name"
Received: null

[Killed] BlockStatement
src/gol/state/userSlice.ts:36:29
   yield put(userActions.setUser(name));
 }
 
-export function* onLogout() {
-  saveLogin('');
-  yield put(userActions.setUser(''));
-}
+export function* onLogout() {}
 
killedBy: userSlice reducer onLogout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "my name"
