[Killed] ArrowFunction
otus-homework/src/gol/utils.ts:9:40
   init: CellState
 ): CellsData {
   return Array.from(Array(boardSize.y)).map(() =>
-    Array.from(Array(boardSize.x)).map(() => init)
+    Array.from(Array(boardSize.x)).map(() => undefined)
   );
 }
killedBy: Board utils should generateBoardXY 3x3 cellStateAlive
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: NaN

[Killed] BlockStatement
otus-homework/src/gol/utils.ts:13:66
   );
 }
 
-export function generateBoard(settings: GameSettings): CellsData {
-  const { boardSize, boardFillPercent } = settings;
-  const isReverseFill = boardFillPercent > 50;
-  const boardCellsCount = boardSize.x * boardSize.y;
-  const countFillCells = Math.floor(boardCellsCount * (boardFillPercent / 100));
-  let countFill = isReverseFill
-    ? boardCellsCount - countFillCells
-    : countFillCells;
-  const init = isReverseFill ? cellStateAlive : cellStateEmpty;
-  const fill = isReverseFill ? cellStateEmpty : cellStateAlive;
-  const cellsData = generateBoardXY(boardSize, init);
-  while (countFill > 0) {
-    const x = Math.floor(Math.random() * boardSize.x);
-    const y = Math.floor(Math.random() * boardSize.y);
-    if (cellsData[y][x] !== fill) {
-      cellsData[y][x] = fill;
-      countFill--;
-    }
-  }
-  return cellsData;
-}
+export function generateBoard(settings: GameSettings): CellsData {}
 
 export function resizeBoard(cellsData: CellsData, boardSize: BoardSize) {
killedBy: Board utils should generateBoard 10x10 75%
statusReason: TypeError: Cannot read property 'length' of undefined

[Timeout] ConditionalExpression
otus-homework/src/gol/utils.ts:15:25
 
 export function generateBoard(settings: GameSettings): CellsData {
   const { boardSize, boardFillPercent } = settings;
-  const isReverseFill = boardFillPercent > 50;
+  const isReverseFill = true;
   const boardCellsCount = boardSize.x * boardSize.y;
   const countFillCells = Math.floor(boardCellsCount * (boardFillPercent / 100));

[Survived] EqualityOperator
otus-homework/src/gol/utils.ts:15:25
 
 export function generateBoard(settings: GameSettings): CellsData {
   const { boardSize, boardFillPercent } = settings;
-  const isReverseFill = boardFillPercent > 50;
+  const isReverseFill = boardFillPercent <= 50;
   const boardCellsCount = boardSize.x * boardSize.y;
   const countFillCells = Math.floor(boardCellsCount * (boardFillPercent / 100));

[Killed] ArithmeticOperator
otus-homework/src/gol/utils.ts:16:27
 export function generateBoard(settings: GameSettings): CellsData {
   const { boardSize, boardFillPercent } = settings;
   const isReverseFill = boardFillPercent > 50;
-  const boardCellsCount = boardSize.x * boardSize.y;
+  const boardCellsCount = boardSize.x / boardSize.y;
   const countFillCells = Math.floor(boardCellsCount * (boardFillPercent / 100));
   let countFill = isReverseFill
killedBy: Board utils should generateBoard 10x10 75%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 75
Received: 99

[Timeout] ArithmeticOperator
otus-homework/src/gol/utils.ts:17:56
   const { boardSize, boardFillPercent } = settings;
   const isReverseFill = boardFillPercent > 50;
   const boardCellsCount = boardSize.x * boardSize.y;
-  const countFillCells = Math.floor(boardCellsCount * (boardFillPercent / 100));
+  const countFillCells = Math.floor(boardCellsCount * (boardFillPercent * 100));
   let countFill = isReverseFill
     ? boardCellsCount - countFillCells

[Timeout] ArithmeticOperator
otus-homework/src/gol/utils.ts:17:37
   const { boardSize, boardFillPercent } = settings;
   const isReverseFill = boardFillPercent > 50;
   const boardCellsCount = boardSize.x * boardSize.y;
-  const countFillCells = Math.floor(boardCellsCount * (boardFillPercent / 100));
+  const countFillCells = Math.floor(boardCellsCount / (boardFillPercent / 100));
   let countFill = isReverseFill
     ? boardCellsCount - countFillCells

[Timeout] ArithmeticOperator
otus-homework/src/gol/utils.ts:19:7
   const boardCellsCount = boardSize.x * boardSize.y;
   const countFillCells = Math.floor(boardCellsCount * (boardFillPercent / 100));
   let countFill = isReverseFill
-    ? boardCellsCount - countFillCells
+    ? boardCellsCount + countFillCells
     : countFillCells;
   const init = isReverseFill ? cellStateAlive : cellStateEmpty;

[Killed] EqualityOperator
otus-homework/src/gol/utils.ts:24:10
   const init = isReverseFill ? cellStateAlive : cellStateEmpty;
   const fill = isReverseFill ? cellStateEmpty : cellStateAlive;
   const cellsData = generateBoardXY(boardSize, init);
-  while (countFill > 0) {
+  while (countFill >= 0) {
     const x = Math.floor(Math.random() * boardSize.x);
     const y = Math.floor(Math.random() * boardSize.y);
killedBy: Board utils should generateBoard 10x10 75%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 75
Received: 74

[Killed] EqualityOperator
otus-homework/src/gol/utils.ts:24:10
   const init = isReverseFill ? cellStateAlive : cellStateEmpty;
   const fill = isReverseFill ? cellStateEmpty : cellStateAlive;
   const cellsData = generateBoardXY(boardSize, init);
-  while (countFill > 0) {
+  while (countFill <= 0) {
     const x = Math.floor(Math.random() * boardSize.x);
     const y = Math.floor(Math.random() * boardSize.y);
killedBy: Board utils should generateBoard 10x10 75%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 75
Received: 100

[Timeout] ArithmeticOperator
otus-homework/src/gol/utils.ts:25:26
   const fill = isReverseFill ? cellStateEmpty : cellStateAlive;
   const cellsData = generateBoardXY(boardSize, init);
   while (countFill > 0) {
-    const x = Math.floor(Math.random() * boardSize.x);
+    const x = Math.floor(Math.random() / boardSize.x);
     const y = Math.floor(Math.random() * boardSize.y);
     if (cellsData[y][x] !== fill) {

[Timeout] ArithmeticOperator
otus-homework/src/gol/utils.ts:26:26
   const cellsData = generateBoardXY(boardSize, init);
   while (countFill > 0) {
     const x = Math.floor(Math.random() * boardSize.x);
-    const y = Math.floor(Math.random() * boardSize.y);
+    const y = Math.floor(Math.random() / boardSize.y);
     if (cellsData[y][x] !== fill) {
       cellsData[y][x] = fill;

[Killed] ConditionalExpression
otus-homework/src/gol/utils.ts:27:9
   while (countFill > 0) {
     const x = Math.floor(Math.random() * boardSize.x);
     const y = Math.floor(Math.random() * boardSize.y);
-    if (cellsData[y][x] !== fill) {
+    if (true) {
       cellsData[y][x] = fill;
       countFill--;
killedBy: Board utils should generateBoard 10x10 75%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 75
Received: 76

[Timeout] EqualityOperator
otus-homework/src/gol/utils.ts:27:9
   while (countFill > 0) {
     const x = Math.floor(Math.random() * boardSize.x);
     const y = Math.floor(Math.random() * boardSize.y);
-    if (cellsData[y][x] !== fill) {
+    if (cellsData[y][x] === fill) {
       cellsData[y][x] = fill;
       countFill--;

[Timeout] UpdateOperator
otus-homework/src/gol/utils.ts:29:7
     const y = Math.floor(Math.random() * boardSize.y);
     if (cellsData[y][x] !== fill) {
       cellsData[y][x] = fill;
-      countFill--;
+      countFill++;
     }
   }

[Killed] ConditionalExpression
otus-homework/src/gol/utils.ts:37:7
 
 export function resizeBoard(cellsData: CellsData, boardSize: BoardSize) {
   let newCellsData = cellsData;
-  if (cellsData.length !== boardSize.y) {
+  if (false) {
     if (cellsData.length > boardSize.y) {
       newCellsData = cellsData.slice(0, boardSize.y);
killedBy: Board utils should resizeBoard from 100x100 to 10x10 30%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 100

[Killed] BlockStatement
otus-homework/src/gol/utils.ts:37:41
 
 export function resizeBoard(cellsData: CellsData, boardSize: BoardSize) {
   let newCellsData = cellsData;
-  if (cellsData.length !== boardSize.y) {
-    if (cellsData.length > boardSize.y) {
-      newCellsData = cellsData.slice(0, boardSize.y);
-    } else if (cellsData.length < boardSize.y) {
-      newCellsData = cellsData.concat(
-        generateBoardXY(
-          { y: boardSize.y - cellsData.length, x: boardSize.x },
-          cellStateEmpty
-        )
-      );
-    }
-  }
+  if (cellsData.length !== boardSize.y) {}
   newCellsData = newCellsData.map((row) => {
     if (row.length === boardSize.x) {
killedBy: Board utils should resizeBoard from 100x100 to 10x10 30%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 100

[Killed] BlockStatement
otus-homework/src/gol/utils.ts:38:41
 export function resizeBoard(cellsData: CellsData, boardSize: BoardSize) {
   let newCellsData = cellsData;
   if (cellsData.length !== boardSize.y) {
-    if (cellsData.length > boardSize.y) {
-      newCellsData = cellsData.slice(0, boardSize.y);
-    } else if (cellsData.length < boardSize.y) {
+    if (cellsData.length > boardSize.y) {} else if (cellsData.length < boardSize.y) {
       newCellsData = cellsData.concat(
         generateBoardXY(
killedBy: Board utils should resizeBoard from 100x100 to 10x10 30%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 100

[Killed] EqualityOperator
otus-homework/src/gol/utils.ts:38:9
 export function resizeBoard(cellsData: CellsData, boardSize: BoardSize) {
   let newCellsData = cellsData;
   if (cellsData.length !== boardSize.y) {
-    if (cellsData.length > boardSize.y) {
+    if (cellsData.length <= boardSize.y) {
       newCellsData = cellsData.slice(0, boardSize.y);
     } else if (cellsData.length < boardSize.y) {
killedBy: Board utils should resizeBoard from 100x100 to 10x10 30%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 100

[Killed] ConditionalExpression
otus-homework/src/gol/utils.ts:40:16
   if (cellsData.length !== boardSize.y) {
     if (cellsData.length > boardSize.y) {
       newCellsData = cellsData.slice(0, boardSize.y);
-    } else if (cellsData.length < boardSize.y) {
+    } else if (false) {
       newCellsData = cellsData.concat(
         generateBoardXY(
killedBy: Board utils should resizeBoard from 10x10 to 80x80 10%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 80
Received: 10

[Killed] BlockStatement
otus-homework/src/gol/utils.ts:40:48
   if (cellsData.length !== boardSize.y) {
     if (cellsData.length > boardSize.y) {
       newCellsData = cellsData.slice(0, boardSize.y);
-    } else if (cellsData.length < boardSize.y) {
-      newCellsData = cellsData.concat(
-        generateBoardXY(
-          { y: boardSize.y - cellsData.length, x: boardSize.x },
-          cellStateEmpty
-        )
-      );
-    }
+    } else if (cellsData.length < boardSize.y) {}
   }
   newCellsData = newCellsData.map((row) => {
killedBy: Board utils should resizeBoard from 10x10 to 80x80 10%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 80
Received: 10

[Killed] ArithmeticOperator
otus-homework/src/gol/utils.ts:43:16
     } else if (cellsData.length < boardSize.y) {
       newCellsData = cellsData.concat(
         generateBoardXY(
-          { y: boardSize.y - cellsData.length, x: boardSize.x },
+          { y: boardSize.y + cellsData.length, x: boardSize.x },
           cellStateEmpty
         )
killedBy: Board utils should resizeBoard from 10x10 to 80x80 10%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 80
Received: 100

[Killed] BlockStatement
otus-homework/src/gol/utils.ts:49:44
       );
     }
   }
-  newCellsData = newCellsData.map((row) => {
-    if (row.length === boardSize.x) {
-      return row;
-    }
-    return row.length > boardSize.x
-      ? row.slice(0, boardSize.x)
-      : row.concat(
-          Array.from(Array(boardSize.x - row.length)).map(() => cellStateEmpty)
-        );
-  });
+  newCellsData = newCellsData.map((row) => {});
   return newCellsData;
 }
killedBy: Board utils should resizeBoard from 100x100 to 10x10 30%
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] ConditionalExpression
otus-homework/src/gol/utils.ts:50:9
     }
   }
   newCellsData = newCellsData.map((row) => {
-    if (row.length === boardSize.x) {
+    if (true) {
       return row;
     }
killedBy: appSlice reducer should setSettings change boardSize
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 5
Received length: 3
Received array:  [0, 1, 0]

[Killed] EqualityOperator
otus-homework/src/gol/utils.ts:50:9
     }
   }
   newCellsData = newCellsData.map((row) => {
-    if (row.length === boardSize.x) {
+    if (row.length !== boardSize.x) {
       return row;
     }
killedBy: Board utils should resizeBoard from 100x100 to 10x10 30%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 100

[Killed] EqualityOperator
otus-homework/src/gol/utils.ts:53:12
     if (row.length === boardSize.x) {
       return row;
     }
-    return row.length > boardSize.x
+    return row.length <= boardSize.x
       ? row.slice(0, boardSize.x)
       : row.concat(
killedBy: App should buttons work
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="0-59"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <h1
      class="css-1emdcgs"
    >

[Killed] ConditionalExpression
otus-homework/src/gol/utils.ts:53:12
     if (row.length === boardSize.x) {
       return row;
     }
-    return row.length > boardSize.x
+    return false
       ? row.slice(0, boardSize.x)
       : row.concat(
killedBy: Board utils should resizeBoard from 100x100 to 10x10 30%
statusReason: RangeError: Invalid array length

[Killed] ArithmeticOperator
otus-homework/src/gol/utils.ts:56:28
     return row.length > boardSize.x
       ? row.slice(0, boardSize.x)
       : row.concat(
-          Array.from(Array(boardSize.x - row.length)).map(() => cellStateEmpty)
+          Array.from(Array(boardSize.x + row.length)).map(() => cellStateEmpty)
         );
   });
killedBy: Board utils should resizeBoard from 10x10 to 80x80 10%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 80
Received: 100

[Survived] ArrowFunction
otus-homework/src/gol/utils.ts:56:59
     return row.length > boardSize.x
       ? row.slice(0, boardSize.x)
       : row.concat(
-          Array.from(Array(boardSize.x - row.length)).map(() => cellStateEmpty)
+          Array.from(Array(boardSize.x - row.length)).map(() => undefined)
         );
   });

[Killed] BlockStatement
otus-homework/src/gol/utils.ts:62:54
   return newCellsData;
 }
 
-export function nextGeneration(cellsData: CellsData) {
-  const newCellsData = generateBoardXY(
-    { x: cellsData[0].length, y: cellsData.length },
-    cellStateEmpty
-  );
-  for (let y = 0; y < cellsData.length; y++) {
-    for (let x = 0; x < cellsData[y].length; x++) {
-      newCellsData[y][x] = getNewState(cellsData, x, y);
-    }
-  }
-  return newCellsData;
-}
+export function nextGeneration(cellsData: CellsData) {}
 
 export function getNewState(cellsData: CellsData, x: number, y: number) {
killedBy: App should call dispatch
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="0-0"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <h1
      class="css-1emdcgs"
    >

[Killed] ObjectLiteral
otus-homework/src/gol/utils.ts:64:5
 
 export function nextGeneration(cellsData: CellsData) {
   const newCellsData = generateBoardXY(
-    { x: cellsData[0].length, y: cellsData.length },
+    {},
     cellStateEmpty
   );
killedBy: Board utils nextGeneration
statusReason: TypeError: Cannot set property '0' of undefined

[Killed] BlockStatement
otus-homework/src/gol/utils.ts:67:46
     { x: cellsData[0].length, y: cellsData.length },
     cellStateEmpty
   );
-  for (let y = 0; y < cellsData.length; y++) {
-    for (let x = 0; x < cellsData[y].length; x++) {
-      newCellsData[y][x] = getNewState(cellsData, x, y);
-    }
-  }
+  for (let y = 0; y < cellsData.length; y++) {}
   return newCellsData;
 }
killedBy: Board utils nextGeneration
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
    Array [
      0,

[Killed] EqualityOperator
otus-homework/src/gol/utils.ts:67:19
     { x: cellsData[0].length, y: cellsData.length },
     cellStateEmpty
   );
-  for (let y = 0; y < cellsData.length; y++) {
+  for (let y = 0; y <= cellsData.length; y++) {
     for (let x = 0; x < cellsData[y].length; x++) {
       newCellsData[y][x] = getNewState(cellsData, x, y);
killedBy: Board utils nextGeneration
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] BlockStatement
otus-homework/src/gol/utils.ts:68:51
     cellStateEmpty
   );
   for (let y = 0; y < cellsData.length; y++) {
-    for (let x = 0; x < cellsData[y].length; x++) {
-      newCellsData[y][x] = getNewState(cellsData, x, y);
-    }
+    for (let x = 0; x < cellsData[y].length; x++) {}
   }
   return newCellsData;
killedBy: Board utils nextGeneration
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
    Array [
      0,

[Killed] EqualityOperator
otus-homework/src/gol/utils.ts:68:21
     cellStateEmpty
   );
   for (let y = 0; y < cellsData.length; y++) {
-    for (let x = 0; x < cellsData[y].length; x++) {
+    for (let x = 0; x >= cellsData[y].length; x++) {
       newCellsData[y][x] = getNewState(cellsData, x, y);
     }
killedBy: Board utils nextGeneration
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
    Array [
      0,

[Killed] BlockStatement
otus-homework/src/gol/utils.ts:75:73
   return newCellsData;
 }
 
-export function getNewState(cellsData: CellsData, x: number, y: number) {
-  const numAlive = countSurrounding(cellsData, x, y);
-  if (numAlive == 2) {
-    return cellsData[y][x];
-  } else if (numAlive == 3) {
-    return cellStateAlive;
-  } else {
-    return cellStateEmpty;
-  }
-}
+export function getNewState(cellsData: CellsData, x: number, y: number) {}
 
 export function countSurrounding(
killedBy: Board utils setNewState
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
otus-homework/src/gol/utils.ts:77:22
 
 export function getNewState(cellsData: CellsData, x: number, y: number) {
   const numAlive = countSurrounding(cellsData, x, y);
-  if (numAlive == 2) {
-    return cellsData[y][x];
-  } else if (numAlive == 3) {
+  if (numAlive == 2) {} else if (numAlive == 3) {
     return cellStateAlive;
   } else {
killedBy: Board utils setNewState
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] EqualityOperator
otus-homework/src/gol/utils.ts:77:7
 
 export function getNewState(cellsData: CellsData, x: number, y: number) {
   const numAlive = countSurrounding(cellsData, x, y);
-  if (numAlive == 2) {
+  if (numAlive != 2) {
     return cellsData[y][x];
   } else if (numAlive == 3) {
killedBy: Board utils setNewState
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
otus-homework/src/gol/utils.ts:79:14
   const numAlive = countSurrounding(cellsData, x, y);
   if (numAlive == 2) {
     return cellsData[y][x];
-  } else if (numAlive == 3) {
+  } else if (false) {
     return cellStateAlive;
   } else {
killedBy: Board utils setNewState
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
otus-homework/src/gol/utils.ts:79:14
   const numAlive = countSurrounding(cellsData, x, y);
   if (numAlive == 2) {
     return cellsData[y][x];
-  } else if (numAlive == 3) {
+  } else if (true) {
     return cellStateAlive;
   } else {
killedBy: Board utils setNewState
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
otus-homework/src/gol/utils.ts:81:10
     return cellsData[y][x];
   } else if (numAlive == 3) {
     return cellStateAlive;
-  } else {
-    return cellStateEmpty;
-  }
+  } else {}
 }
 
killedBy: Board utils setNewState
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
otus-homework/src/gol/utils.ts:90:11
   cellsData: CellsData,
   x: number,
   y: number
-): number {
-  return (
-    isAlive(cellsData, x - 1, y - 1) +
-    isAlive(cellsData, x, y - 1) +
-    isAlive(cellsData, x + 1, y - 1) +
-    isAlive(cellsData, x - 1, y) +
-    isAlive(cellsData, x + 1, y) +
-    isAlive(cellsData, x - 1, y + 1) +
-    isAlive(cellsData, x, y + 1) +
-    isAlive(cellsData, x + 1, y + 1)
-  );
-}
+): number {}
 
 export function isAlive(cellsData: CellsData, x: number, y: number): CellState {
killedBy: Board utils countSurrounding
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ArithmeticOperator
otus-homework/src/gol/utils.ts:92:5
   y: number
 ): number {
   return (
-    isAlive(cellsData, x - 1, y - 1) +
-    isAlive(cellsData, x, y - 1) +
+    isAlive(cellsData, x - 1, y - 1) - isAlive(cellsData, x, y - 1) +
     isAlive(cellsData, x + 1, y - 1) +
     isAlive(cellsData, x - 1, y) +
killedBy: Board utils countSurrounding
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] ArithmeticOperator
otus-homework/src/gol/utils.ts:92:5
   y: number
 ): number {
   return (
-    isAlive(cellsData, x - 1, y - 1) +
-    isAlive(cellsData, x, y - 1) +
-    isAlive(cellsData, x + 1, y - 1) +
+    isAlive(cellsData, x - 1, y - 1) + isAlive(cellsData, x, y - 1) - isAlive(cellsData, x + 1, y - 1) +
     isAlive(cellsData, x - 1, y) +
     isAlive(cellsData, x + 1, y) +
killedBy: Board utils nextGeneration
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -6,15 +6,15 @@
      0,
    ],

[Killed] ArithmeticOperator
otus-homework/src/gol/utils.ts:93:27
 ): number {
   return (
     isAlive(cellsData, x - 1, y - 1) +
-    isAlive(cellsData, x, y - 1) +
+    isAlive(cellsData, x, y + 1) +
     isAlive(cellsData, x + 1, y - 1) +
     isAlive(cellsData, x - 1, y) +
killedBy: Board utils countSurrounding
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] ArithmeticOperator
otus-homework/src/gol/utils.ts:94:31
   return (
     isAlive(cellsData, x - 1, y - 1) +
     isAlive(cellsData, x, y - 1) +
-    isAlive(cellsData, x + 1, y - 1) +
+    isAlive(cellsData, x + 1, y + 1) +
     isAlive(cellsData, x - 1, y) +
     isAlive(cellsData, x + 1, y) +
killedBy: Board utils countSurrounding
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] ArithmeticOperator
otus-homework/src/gol/utils.ts:94:24
   return (
     isAlive(cellsData, x - 1, y - 1) +
     isAlive(cellsData, x, y - 1) +
-    isAlive(cellsData, x + 1, y - 1) +
+    isAlive(cellsData, x - 1, y - 1) +
     isAlive(cellsData, x - 1, y) +
     isAlive(cellsData, x + 1, y) +
killedBy: Board utils nextGeneration
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -10,11 +10,11 @@
      1,
      0,

[Killed] ArithmeticOperator
otus-homework/src/gol/utils.ts:95:24
     isAlive(cellsData, x - 1, y - 1) +
     isAlive(cellsData, x, y - 1) +
     isAlive(cellsData, x + 1, y - 1) +
-    isAlive(cellsData, x - 1, y) +
+    isAlive(cellsData, x + 1, y) +
     isAlive(cellsData, x + 1, y) +
     isAlive(cellsData, x - 1, y + 1) +
killedBy: Board utils countSurrounding
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 4

[Killed] ArithmeticOperator
otus-homework/src/gol/utils.ts:96:24
     isAlive(cellsData, x, y - 1) +
     isAlive(cellsData, x + 1, y - 1) +
     isAlive(cellsData, x - 1, y) +
-    isAlive(cellsData, x + 1, y) +
+    isAlive(cellsData, x - 1, y) +
     isAlive(cellsData, x - 1, y + 1) +
     isAlive(cellsData, x, y + 1) +
killedBy: Board utils countSurrounding
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 2

[Killed] ArithmeticOperator
otus-homework/src/gol/utils.ts:97:24
     isAlive(cellsData, x + 1, y - 1) +
     isAlive(cellsData, x - 1, y) +
     isAlive(cellsData, x + 1, y) +
-    isAlive(cellsData, x - 1, y + 1) +
+    isAlive(cellsData, x + 1, y + 1) +
     isAlive(cellsData, x, y + 1) +
     isAlive(cellsData, x + 1, y + 1)
killedBy: Board utils countSurrounding
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] ArithmeticOperator
otus-homework/src/gol/utils.ts:97:31
     isAlive(cellsData, x + 1, y - 1) +
     isAlive(cellsData, x - 1, y) +
     isAlive(cellsData, x + 1, y) +
-    isAlive(cellsData, x - 1, y + 1) +
+    isAlive(cellsData, x - 1, y - 1) +
     isAlive(cellsData, x, y + 1) +
     isAlive(cellsData, x + 1, y + 1)
killedBy: Board utils countSurrounding
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 2

[Killed] ArithmeticOperator
otus-homework/src/gol/utils.ts:98:27
     isAlive(cellsData, x - 1, y) +
     isAlive(cellsData, x + 1, y) +
     isAlive(cellsData, x - 1, y + 1) +
-    isAlive(cellsData, x, y + 1) +
+    isAlive(cellsData, x, y - 1) +
     isAlive(cellsData, x + 1, y + 1)
   );
killedBy: Board utils countSurrounding
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ArithmeticOperator
otus-homework/src/gol/utils.ts:99:24
     isAlive(cellsData, x + 1, y) +
     isAlive(cellsData, x - 1, y + 1) +
     isAlive(cellsData, x, y + 1) +
-    isAlive(cellsData, x + 1, y + 1)
+    isAlive(cellsData, x - 1, y + 1)
   );
 }
killedBy: Board utils countSurrounding
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ArithmeticOperator
otus-homework/src/gol/utils.ts:99:31
     isAlive(cellsData, x + 1, y) +
     isAlive(cellsData, x - 1, y + 1) +
     isAlive(cellsData, x, y + 1) +
-    isAlive(cellsData, x + 1, y + 1)
+    isAlive(cellsData, x + 1, y - 1)
   );
 }
killedBy: Board utils countSurrounding
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] BlockStatement
otus-homework/src/gol/utils.ts:103:80
   );
 }
 
-export function isAlive(cellsData: CellsData, x: number, y: number): CellState {
-  if (y < 0 || y >= cellsData.length || x < 0 || x >= cellsData[y].length) {
-    return cellStateEmpty;
-  }
-  return cellsData[y][x];
-}
+export function isAlive(cellsData: CellsData, x: number, y: number): CellState {}
 
 export function speedToMs(speed: number): number {
killedBy: Board utils should check isAlive cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ConditionalExpression
otus-homework/src/gol/utils.ts:104:41
 }
 
 export function isAlive(cellsData: CellsData, x: number, y: number): CellState {
-  if (y < 0 || y >= cellsData.length || x < 0 || x >= cellsData[y].length) {
+  if (y < 0 || y >= cellsData.length || false || x >= cellsData[y].length) {
     return cellStateEmpty;
   }
killedBy: Board utils countSurrounding
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: NaN

[Killed] LogicalOperator
otus-homework/src/gol/utils.ts:104:7
 }
 
 export function isAlive(cellsData: CellsData, x: number, y: number): CellState {
-  if (y < 0 || y >= cellsData.length || x < 0 || x >= cellsData[y].length) {
+  if (y < 0 && y >= cellsData.length || x < 0 || x >= cellsData[y].length) {
     return cellStateEmpty;
   }
killedBy: Board utils should check isAlive cell
statusReason: TypeError: Cannot read property 'length' of undefined

[Timeout] BlockStatement
otus-homework/src/gol/utils.ts:110:50
   return cellsData[y][x];
 }
 
-export function speedToMs(speed: number): number {
-  switch (speed) {
-    case 1:
-      return 1000;
-    case 2:
-      return 500;
-    case 3:
-      return 250;
-    case 4:
-      return 100;
-    default:
-      return 500;
-  }
-}
+export function speedToMs(speed: number): number {}
 

[Killed] ConditionalExpression
otus-homework/src/gol/utils.ts:112:5
 
 export function speedToMs(speed: number): number {
   switch (speed) {
-    case 1:
-      return 1000;
+    case 1:
     case 2:
       return 500;
killedBy: Board utils speedToMs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1000
Received: 500

[Killed] ConditionalExpression
otus-homework/src/gol/utils.ts:114:5
   switch (speed) {
     case 1:
       return 1000;
-    case 2:
-      return 500;
+    case 2:
     case 3:
       return 250;
killedBy: Board utils speedToMs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 250

[Killed] ConditionalExpression
otus-homework/src/gol/utils.ts:116:5
       return 1000;
     case 2:
       return 500;
-    case 3:
-      return 250;
+    case 3:
     case 4:
       return 100;
killedBy: Board utils speedToMs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 250
Received: 100
