[Killed] ConditionalExpression
otus-homework/src/gol/utils.ts:118:5
       return 500;
     case 3:
       return 250;
-    case 4:
-      return 100;
+    case 4:
     default:
       return 500;
killedBy: Board utils speedToMs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 500

[Killed] ConditionalExpression
otus-homework/src/gol/utils.ts:120:5
       return 250;
     case 4:
       return 100;
-    default:
-      return 500;
+    default:
   }
 }
killedBy: Board utils speedToMs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: undefined
